#### [`repos-official-new`] Terraform Plan 📖`success`

<a href="https://app.terraform.io/app/cdktf-team/prebuilt-providers-official-new/runs/run-3V4iD9yYFzHiRqXo" target="_blank">Remote Plan Link ↗️</a>

<details><summary>Show Plan</summary>

```tf
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/prebuilt-providers-official-new/runs/run-3V4iD9yYFzHiRqXo

Waiting for the plan to start...

Terraform v1.6.5
on linux_amd64
Initializing plugins and modules...
data.github_team.cdktf-team-cdktf: Reading...
data.github_team.cdktf-team-cdktf: Read complete after 7s [id=6602018]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_branch_protection.reposofficialnew_cdktfproviderad_repositorysetup_mainprotection_67975441 will be updated in-place
  ~ resource "github_branch_protection" "reposofficialnew_cdktfproviderad_repositorysetup_mainprotection_67975441" {
        id                              = "BPR_kwDOIIyyB84B07ra"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.reposofficialnew_cdktfproviderazurestack_repositorysetup_mainprotection_A3308AE9 will be updated in-place
  ~ resource "github_branch_protection" "reposofficialnew_cdktfproviderazurestack_repositorysetup_mainprotection_A3308AE9" {
        id                              = "BPR_kwDOIIy1rc4B07rr"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.reposofficialnew_cdktfproviderboundary_repositorysetup_mainprotection_C6785CF1 will be updated in-place
  ~ resource "github_branch_protection" "reposofficialnew_cdktfproviderboundary_repositorysetup_mainprotection_C6785CF1" {
        id                              = "BPR_kwDOIIy5Y84B07sy"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.reposofficialnew_cdktfproviderconsul_repositorysetup_mainprotection_0FD965B5 will be updated in-place
  ~ resource "github_branch_protection" "reposofficialnew_cdktfproviderconsul_repositorysetup_mainprotection_0FD965B5" {
        id                              = "BPR_kwDOIIy2Yc4B07sL"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.reposofficialnew_cdktfproviderdns_repositorysetup_mainprotection_29DCB0B4 will be updated in-place
  ~ resource "github_branch_protection" "reposofficialnew_cdktfproviderdns_repositorysetup_mainprotection_29DCB0B4" {
        id                              = "BPR_kwDOIIyxt84B07q3"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.reposofficialnew_cdktfprovidergoogleworkspace_repositorysetup_mainprotection_5296EBDE will be updated in-place
  ~ resource "github_branch_protection" "reposofficialnew_cdktfprovidergoogleworkspace_repositorysetup_mainprotection_5296EBDE" {
        id                              = "BPR_kwDOIIyyfc4B07rF"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.reposofficialnew_cdktfproviderhcp_repositorysetup_mainprotection_2F3985BD will be updated in-place
  ~ resource "github_branch_protection" "reposofficialnew_cdktfproviderhcp_repositorysetup_mainprotection_2F3985BD" {
        id                              = "BPR_kwDOIIy2jc4B07ru"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.reposofficialnew_cdktfproviderhcs_repositorysetup_mainprotection_41480D25 will be updated in-place
  ~ resource "github_branch_protection" "reposofficialnew_cdktfproviderhcs_repositorysetup_mainprotection_41480D25" {
        id                              = "BPR_kwDOIIy5dc4B07sh"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.reposofficialnew_cdktfproviderhttp_repositorysetup_mainprotection_B33863E9 will be updated in-place
  ~ resource "github_branch_protection" "reposofficialnew_cdktfproviderhttp_repositorysetup_mainprotection_B33863E9" {
        id                              = "BPR_kwDOIIyyU84B07q8"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.reposofficialnew_cdktfprovidernomad_repositorysetup_mainprotection_13C0DCFB will be updated in-place
  ~ resource "github_branch_protection" "reposofficialnew_cdktfprovidernomad_repositorysetup_mainprotection_13C0DCFB" {
        id                              = "BPR_kwDOIIy2os4B07sB"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.reposofficialnew_cdktfprovideropc_repositorysetup_mainprotection_010523D3 will be updated in-place
  ~ resource "github_branch_protection" "reposofficialnew_cdktfprovideropc_repositorysetup_mainprotection_010523D3" {
        id                              = "BPR_kwDOIIy5Us4B07r0"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.reposofficialnew_cdktfprovideroraclepaas_repositorysetup_mainprotection_8A38A381 will be updated in-place
  ~ resource "github_branch_protection" "reposofficialnew_cdktfprovideroraclepaas_repositorysetup_mainprotection_8A38A381" {
        id                              = "BPR_kwDOIIy5EM4B07so"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.reposofficialnew_cdktfprovidersalesforce_repositorysetup_mainprotection_DE212A5B will be updated in-place
  ~ resource "github_branch_protection" "reposofficialnew_cdktfprovidersalesforce_repositorysetup_mainprotection_DE212A5B" {
        id                              = "BPR_kwDOIIy2Mc4B07sN"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.reposofficialnew_cdktfprovidervsphere_repositorysetup_mainprotection_28589C45 will be updated in-place
  ~ resource "github_branch_protection" "reposofficialnew_cdktfprovidervsphere_repositorysetup_mainprotection_28589C45" {
        id                              = "BPR_kwDOIIyyHM4B07rh"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.reposofficialnew_cdktfproviderwaypoint_repositorysetup_mainprotection_9AF3484C will be updated in-place
  ~ resource "github_branch_protection" "reposofficialnew_cdktfproviderwaypoint_repositorysetup_mainprotection_9AF3484C" {
        id                              = "BPR_kwDOJ6pr-M4CWWQh"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_issue_label.cdktf-provider-ad-go_repository-setup_auto-approve-label_E48C6540 will be created
  + resource "github_issue_label" "cdktf-provider-ad-go_repository-setup_auto-approve-label_E48C6540" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-ad-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-ad_repository-setup_auto-approve-label_2836843A will be created
  + resource "github_issue_label" "cdktf-provider-ad_repository-setup_auto-approve-label_2836843A" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-ad"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-azurestack-go_repository-setup_auto-approve-label_94525FB8 will be created
  + resource "github_issue_label" "cdktf-provider-azurestack-go_repository-setup_auto-approve-label_94525FB8" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-azurestack-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-azurestack_repository-setup_auto-approve-label_13BDFA9C will be created
  + resource "github_issue_label" "cdktf-provider-azurestack_repository-setup_auto-approve-label_13BDFA9C" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-azurestack"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-boundary-go_repository-setup_auto-approve-label_9BDEBB6A will be created
  + resource "github_issue_label" "cdktf-provider-boundary-go_repository-setup_auto-approve-label_9BDEBB6A" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-boundary-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-boundary_repository-setup_auto-approve-label_5F0F3238 will be created
  + resource "github_issue_label" "cdktf-provider-boundary_repository-setup_auto-approve-label_5F0F3238" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-boundary"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-consul-go_repository-setup_auto-approve-label_91E67C64 will be created
  + resource "github_issue_label" "cdktf-provider-consul-go_repository-setup_auto-approve-label_91E67C64" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-consul-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-consul_repository-setup_auto-approve-label_5130E5EF will be created
  + resource "github_issue_label" "cdktf-provider-consul_repository-setup_auto-approve-label_5130E5EF" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-consul"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-dns-go_repository-setup_auto-approve-label_575F9EF8 will be created
  + resource "github_issue_label" "cdktf-provider-dns-go_repository-setup_auto-approve-label_575F9EF8" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-dns-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-dns_repository-setup_auto-approve-label_2FA38B7C will be created
  + resource "github_issue_label" "cdktf-provider-dns_repository-setup_auto-approve-label_2FA38B7C" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-dns"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-googleworkspace-go_repository-setup_auto-approve-label_5AD4E6B4 will be created
  + resource "github_issue_label" "cdktf-provider-googleworkspace-go_repository-setup_auto-approve-label_5AD4E6B4" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-googleworkspace-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-googleworkspace_repository-setup_auto-approve-label_40BFD4FD will be created
  + resource "github_issue_label" "cdktf-provider-googleworkspace_repository-setup_auto-approve-label_40BFD4FD" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-googleworkspace"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-hcp-go_repository-setup_auto-approve-label_EB6DC365 will be created
  + resource "github_issue_label" "cdktf-provider-hcp-go_repository-setup_auto-approve-label_EB6DC365" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-hcp-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-hcp_repository-setup_auto-approve-label_3DAF48FE will be created
  + resource "github_issue_label" "cdktf-provider-hcp_repository-setup_auto-approve-label_3DAF48FE" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-hcp"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-hcs-go_repository-setup_auto-approve-label_692BC016 will be created
  + resource "github_issue_label" "cdktf-provider-hcs-go_repository-setup_auto-approve-label_692BC016" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-hcs-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-hcs_repository-setup_auto-approve-label_3AE8C521 will be created
  + resource "github_issue_label" "cdktf-provider-hcs_repository-setup_auto-approve-label_3AE8C521" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-hcs"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-http-go_repository-setup_auto-approve-label_14191CC9 will be created
  + resource "github_issue_label" "cdktf-provider-http-go_repository-setup_auto-approve-label_14191CC9" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-http-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-http_repository-setup_auto-approve-label_EF772BB5 will be created
  + resource "github_issue_label" "cdktf-provider-http_repository-setup_auto-approve-label_EF772BB5" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-http"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-nomad-go_repository-setup_auto-approve-label_03662F49 will be created
  + resource "github_issue_label" "cdktf-provider-nomad-go_repository-setup_auto-approve-label_03662F49" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-nomad-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-nomad_repository-setup_auto-approve-label_DD92A4A1 will be created
  + resource "github_issue_label" "cdktf-provider-nomad_repository-setup_auto-approve-label_DD92A4A1" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-nomad"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-opc-go_repository-setup_auto-approve-label_EDA391AF will be created
  + resource "github_issue_label" "cdktf-provider-opc-go_repository-setup_auto-approve-label_EDA391AF" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-opc-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-opc_repository-setup_auto-approve-label_510FE212 will be created
  + resource "github_issue_label" "cdktf-provider-opc_repository-setup_auto-approve-label_510FE212" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-opc"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-oraclepaas-go_repository-setup_auto-approve-label_8FAAF7E4 will be created
  + resource "github_issue_label" "cdktf-provider-oraclepaas-go_repository-setup_auto-approve-label_8FAAF7E4" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-oraclepaas-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-oraclepaas_repository-setup_auto-approve-label_B4903866 will be created
  + resource "github_issue_label" "cdktf-provider-oraclepaas_repository-setup_auto-approve-label_B4903866" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-oraclepaas"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-salesforce-go_repository-setup_auto-approve-label_0798CB2A will be created
  + resource "github_issue_label" "cdktf-provider-salesforce-go_repository-setup_auto-approve-label_0798CB2A" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-salesforce-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-salesforce_repository-setup_auto-approve-label_24462F48 will be created
  + resource "github_issue_label" "cdktf-provider-salesforce_repository-setup_auto-approve-label_24462F48" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-salesforce"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-vsphere-go_repository-setup_auto-approve-label_88D1659F will be created
  + resource "github_issue_label" "cdktf-provider-vsphere-go_repository-setup_auto-approve-label_88D1659F" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-vsphere-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-vsphere_repository-setup_auto-approve-label_26689A29 will be created
  + resource "github_issue_label" "cdktf-provider-vsphere_repository-setup_auto-approve-label_26689A29" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-vsphere"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-waypoint-go_repository-setup_auto-approve-label_618CED66 will be created
  + resource "github_issue_label" "cdktf-provider-waypoint-go_repository-setup_auto-approve-label_618CED66" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-waypoint-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-waypoint_repository-setup_auto-approve-label_E4899A09 will be created
  + resource "github_issue_label" "cdktf-provider-waypoint_repository-setup_auto-approve-label_E4899A09" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-waypoint"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderad_repositorysetup_noautocloselabel_6C7C3C96 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderad_repositorysetup_noautocloselabel_6C7C3C96" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-ad"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovideradgo_repositorysetup_noautocloselabel_A30350EF will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovideradgo_repositorysetup_noautocloselabel_A30350EF" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-ad-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderazurestack_repositorysetup_noautocloselabel_A81433DC will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderazurestack_repositorysetup_noautocloselabel_A81433DC" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-azurestack"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderazurestackgo_repositorysetup_noautocloselabel_947B9F37 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderazurestackgo_repositorysetup_noautocloselabel_947B9F37" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-azurestack-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderboundary_repositorysetup_noautocloselabel_86E4460C will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderboundary_repositorysetup_noautocloselabel_86E4460C" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-boundary"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderboundarygo_repositorysetup_noautocloselabel_64B74815 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderboundarygo_repositorysetup_noautocloselabel_64B74815" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-boundary-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderconsul_repositorysetup_noautocloselabel_F7F387CB will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderconsul_repositorysetup_noautocloselabel_F7F387CB" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-consul"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderconsulgo_repositorysetup_noautocloselabel_9D78571C will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderconsulgo_repositorysetup_noautocloselabel_9D78571C" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-consul-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderdns_repositorysetup_noautocloselabel_86EBEC51 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderdns_repositorysetup_noautocloselabel_86EBEC51" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-dns"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderdnsgo_repositorysetup_noautocloselabel_DA7A9280 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderdnsgo_repositorysetup_noautocloselabel_DA7A9280" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-dns-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovidergoogleworkspace_repositorysetup_noautocloselabel_0DCCB1B2 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovidergoogleworkspace_repositorysetup_noautocloselabel_0DCCB1B2" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-googleworkspace"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovidergoogleworkspacego_repositorysetup_noautocloselabel_69424C8C will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovidergoogleworkspacego_repositorysetup_noautocloselabel_69424C8C" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-googleworkspace-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderhcp_repositorysetup_noautocloselabel_7C802706 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderhcp_repositorysetup_noautocloselabel_7C802706" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-hcp"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderhcpgo_repositorysetup_noautocloselabel_727AC335 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderhcpgo_repositorysetup_noautocloselabel_727AC335" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-hcp-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderhcs_repositorysetup_noautocloselabel_04AE71A8 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderhcs_repositorysetup_noautocloselabel_04AE71A8" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-hcs"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderhcsgo_repositorysetup_noautocloselabel_DC0E673B will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderhcsgo_repositorysetup_noautocloselabel_DC0E673B" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-hcs-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderhttp_repositorysetup_noautocloselabel_0086EB76 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderhttp_repositorysetup_noautocloselabel_0086EB76" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-http"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderhttpgo_repositorysetup_noautocloselabel_25967D90 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderhttpgo_repositorysetup_noautocloselabel_25967D90" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-http-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovidernomad_repositorysetup_noautocloselabel_923D399A will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovidernomad_repositorysetup_noautocloselabel_923D399A" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-nomad"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovidernomadgo_repositorysetup_noautocloselabel_2F8C2583 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovidernomadgo_repositorysetup_noautocloselabel_2F8C2583" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-nomad-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovideropc_repositorysetup_noautocloselabel_6F55D1DB will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovideropc_repositorysetup_noautocloselabel_6F55D1DB" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-opc"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovideropcgo_repositorysetup_noautocloselabel_F805045C will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovideropcgo_repositorysetup_noautocloselabel_F805045C" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-opc-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovideroraclepaas_repositorysetup_noautocloselabel_02D9F511 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovideroraclepaas_repositorysetup_noautocloselabel_02D9F511" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-oraclepaas"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovideroraclepaasgo_repositorysetup_noautocloselabel_B2C1F5CA will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovideroraclepaasgo_repositorysetup_noautocloselabel_B2C1F5CA" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-oraclepaas-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovidersalesforce_repositorysetup_noautocloselabel_3E68750D will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovidersalesforce_repositorysetup_noautocloselabel_3E68750D" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-salesforce"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovidersalesforcego_repositorysetup_noautocloselabel_D27AC2D2 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovidersalesforcego_repositorysetup_noautocloselabel_D27AC2D2" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-salesforce-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovidervsphere_repositorysetup_noautocloselabel_81F52A35 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovidervsphere_repositorysetup_noautocloselabel_81F52A35" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-vsphere"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfprovidervspherego_repositorysetup_noautocloselabel_D5408900 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfprovidervspherego_repositorysetup_noautocloselabel_D5408900" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-vsphere-go"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderwaypoint_repositorysetup_noautocloselabel_0FA778E5 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderwaypoint_repositorysetup_noautocloselabel_0FA778E5" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-waypoint"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderwaypointgo_repositorysetup_noautocloselabel_3B4DA0A6 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderwaypointgo_repositorysetup_noautocloselabel_3B4DA0A6" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktf-provider-waypoint-go"
      + url        = (known after apply)
    }

  # github_repository.reposofficialnew_cdktfproviderad_repo_B501EA48 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderad_repo_B501EA48" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-ad"
        name                        = "cdktf-provider-ad"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.reposofficialnew_cdktfprovideradgo_repo_E962AB9E will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfprovideradgo_repo_E962AB9E" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-ad-go"
        name                        = "cdktf-provider-ad-go"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.reposofficialnew_cdktfproviderazurestack_repo_F02F6EBF will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderazurestack_repo_F02F6EBF" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-azurestack"
        name                        = "cdktf-provider-azurestack"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.reposofficialnew_cdktfproviderazurestackgo_repo_A52C1E1A will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderazurestackgo_repo_A52C1E1A" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-azurestack-go"
        name                        = "cdktf-provider-azurestack-go"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.reposofficialnew_cdktfproviderboundary_repo_1EF8E2A8 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderboundary_repo_1EF8E2A8" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-boundary"
        name                        = "cdktf-provider-boundary"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.reposofficialnew_cdktfproviderboundarygo_repo_8F564388 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderboundarygo_repo_8F564388" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-boundary-go"
        name                        = "cdktf-provider-boundary-go"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.reposofficialnew_cdktfproviderconsul_repo_EA05D767 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderconsul_repo_EA05D767" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-consul"
        name                        = "cdktf-provider-consul"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.reposofficialnew_cdktfproviderconsulgo_repo_6C3E1652 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderconsulgo_repo_6C3E1652" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-consul-go"
        name                        = "cdktf-provider-consul-go"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.reposofficialnew_cdktfproviderdns_repo_E696C338 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderdns_repo_E696C338" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-dns"
        name                        = "cdktf-provider-dns"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.reposofficialnew_cdktfproviderdnsgo_repo_D8B14775 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderdnsgo_repo_D8B14775" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-dns-go"
        name                        = "cdktf-provider-dns-go"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.reposofficialnew_cdktfprovidergoogleworkspace_repo_DC6187AE will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfprovidergoogleworkspace_repo_DC6187AE" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-googleworkspace"
        name                        = "cdktf-provider-googleworkspace"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.reposofficialnew_cdktfprovidergoogleworkspacego_repo_A0A12185 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfprovidergoogleworkspacego_repo_A0A12185" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-googleworkspace-go"
        name                        = "cdktf-provider-googleworkspace-go"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.reposofficialnew_cdktfproviderhcp_repo_BAD7E858 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderhcp_repo_BAD7E858" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-hcp"
        name                        = "cdktf-provider-hcp"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.reposofficialnew_cdktfproviderhcpgo_repo_B866A962 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderhcpgo_repo_B866A962" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-hcp-go"
        name                        = "cdktf-provider-hcp-go"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.reposofficialnew_cdktfproviderhcs_repo_1C1956F4 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderhcs_repo_1C1956F4" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-hcs"
        name                        = "cdktf-provider-hcs"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.reposofficialnew_cdktfproviderhcsgo_repo_DDBF52DC will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderhcsgo_repo_DDBF52DC" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-hcs-go"
        name                        = "cdktf-provider-hcs-go"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.reposofficialnew_cdktfproviderhttp_repo_0228697D will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderhttp_repo_0228697D" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-http"
        name                        = "cdktf-provider-http"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.reposofficialnew_cdktfproviderhttpgo_repo_3253ED7E will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderhttpgo_repo_3253ED7E" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-http-go"
        name                        = "cdktf-provider-http-go"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.reposofficialnew_cdktfprovidernomad_repo_E3E08A10 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfprovidernomad_repo_E3E08A10" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-nomad"
        name                        = "cdktf-provider-nomad"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.reposofficialnew_cdktfprovidernomadgo_repo_E20DF0A6 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfprovidernomadgo_repo_E20DF0A6" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-nomad-go"
        name                        = "cdktf-provider-nomad-go"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.reposofficialnew_cdktfprovideropc_repo_36585570 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfprovideropc_repo_36585570" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-opc"
        name                        = "cdktf-provider-opc"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.reposofficialnew_cdktfprovideropcgo_repo_3FB9B00C will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfprovideropcgo_repo_3FB9B00C" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-opc-go"
        name                        = "cdktf-provider-opc-go"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.reposofficialnew_cdktfprovideroraclepaas_repo_59E01823 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfprovideroraclepaas_repo_59E01823" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-oraclepaas"
        name                        = "cdktf-provider-oraclepaas"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.reposofficialnew_cdktfprovideroraclepaasgo_repo_7B5D271C will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfprovideroraclepaasgo_repo_7B5D271C" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-oraclepaas-go"
        name                        = "cdktf-provider-oraclepaas-go"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.reposofficialnew_cdktfprovidersalesforce_repo_00119DDA will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfprovidersalesforce_repo_00119DDA" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-salesforce"
        name                        = "cdktf-provider-salesforce"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.reposofficialnew_cdktfprovidersalesforcego_repo_2BE83507 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfprovidersalesforcego_repo_2BE83507" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-salesforce-go"
        name                        = "cdktf-provider-salesforce-go"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.reposofficialnew_cdktfprovidervsphere_repo_AD726BE1 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfprovidervsphere_repo_AD726BE1" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-vsphere"
        name                        = "cdktf-provider-vsphere"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.reposofficialnew_cdktfprovidervspherego_repo_2CCCF4D0 will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfprovidervspherego_repo_2CCCF4D0" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-vsphere-go"
        name                        = "cdktf-provider-vsphere-go"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.reposofficialnew_cdktfproviderwaypoint_repo_88065F9C will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderwaypoint_repo_88065F9C" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-waypoint"
        name                        = "cdktf-provider-waypoint"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.reposofficialnew_cdktfproviderwaypointgo_repo_A9252B7B will be updated in-place
  ~ resource "github_repository" "reposofficialnew_cdktfproviderwaypointgo_repo_A9252B7B" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-waypoint-go"
        name                        = "cdktf-provider-waypoint-go"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 60 to add, 45 to change, 0 to destroy.


```

</details>

*Pusher: @DanielMSchmidt, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*